depot_agile_dev_rails_book/app/controllers/store_controller.rb

  def add_to_cart
    begin
      product             = Product.find params[:id]
---
SELECT * FROM "products" WHERE ("products"."id" = 5)

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.build_from_cart(@cart)
    if @order.save
---
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('Alan', 'Mario Vaz', '2010-03-22 13:09:50', '2010-03-22 13:09:50', 'cc', 'test@test.com')