depot_agile_dev_rails_book/app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "updated_at" = '2010-03-23 16:14:19', "salt" = '21835303000.416122165881989', "hashed_password" = '66ebf4db3adb948f0136a02b6e892e22fffe28b9' WHERE "id" = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])